Autodesk.Revit.DB.FabricationAncillaryUsage.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FabricationAncillaryUsage.ProductCode
A unique string code that idnenifies the ancillary in the fabriction database in order to purchase it.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationAncillaryUsage.Length
Length of required ancillaries.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationAncillaryUsage.Quantity
Quantity of required ancillaries.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationAncillaryUsage.AncillaryDepth
Depth of required ancillary if it isn't round.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationAncillaryUsage.AncillaryWidthOrDiameter
Width or diameter of required ancillary.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationAncillaryUsage.AncillaryId
Fabrication ancillary database identifier.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationAncillaryUsage.UsageType
Fabrication ancillary usage type.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationAncillaryUsage.Type
Fabrication ancillary type.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationAncillaryUsage
Structure that holds information about the usage of a fabrication ancillary
Since:
2017 Subscription Update